// Створіть дві змінні для зберігання значень двох текстових полів. Перевірте, чи обидві змінні не є порожніми. Якщо обидва поля заповнені, вивести повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".

const textFirst = prompt("Напишіть будь-що");
const textSecond = prompt("Ще раз напишіть будь-що");
if (textFirst.length > 0 && textSecond.length > 0) {
  alert("Обидва поля заповнені");
} else {
  alert("Не всі поля заповнені");
}

// Створіть дві змінні для зберігання числових значень. Обчисліть їх суму. Якщо сума більше 10 — виведіть "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

const numberOne = prompt("Введіть число");
const numberTwo = prompt("Введіть друге число");

if (parseInt(numberOne) + parseInt(numberTwo) > 10) {
  alert("Сума більше за 10");
} else {
  alert("Сума менша або дорівнює 10");
}
